{"data":{"dataJson":{"projects":[{"title":"Western Standard Beer website","link":"https://westernstandardbeer.com","description":"I was the sole developer on this project. It was made in Vuejs and involved some trickly elements, such as setting up the svg border to scale properly. It also includes integration with Curate.io to add an Instagram feed, as this was a fully static website.","tech":["Vuejs","javascript","html/css"],"id":"western","imgSrc":"projects/western-standard.png"},{"title":"Woodbridge Wines Website","link":"https://woodbridgewines.com","description":"This was a wine website made in vuejs. It includes several dynamic pages that are generated through json files. The greatest challenge on this website was creating the wine description drop down effect, which involved animating the height on a container below a wine. ","tech":["Vuejs","javascript","html/css"],"id":"woodbridge","imgSrc":"projects/woodbridge.png"},{"title":"Salesforce Holiday Website","link":"","description":"This website was a quick turnaround holiday website. It involved some fun page transitions and other general animation. I am proud of the quality of this project given the very short development time of two weeks. Unfortunately this project was short lived and I am happy to provide a private demo upon request.","tech":["Vuejs","javascript","html/css"],"id":"sf","imgSrc":"projects/sf.png"},{"title":"Giveaway promotion website","link":"","description":"This website was a giveaway website created for Lays and The Voice. The website is no longer active but I am happy to provide a private demo upon request. This was my most technical project as it involved a chair spin animation and countdown based on the number of entries a user had made. I created the chair spin animation by using css animation to transition over a sprite sheet. I was responsible for coding the frontend.","tech":["Vuejs","javascript","html/css","apollo/graphql on frontend"],"id":"lays","imgSrc":"projects/lays.png"},{"title":"Pepsi Gift it Forward","link":"","description":"On this project I assisted in creating various modules and functionality behind one of our Senior Developers. The most interesting feature that I created was an image generator that would create an image with the users name and a phrase that they selected on a small gift card picture. To do this I used canvas to generate the image. The challenge I faced was how to center text based on different font sizes and name lengths. This promotion is over but I can provide a private demo upon request.","tech":["Vuejs","javascript","html/css","html canvas"],"id":"pepsi","imgSrc":"projects/pepsi.png"}]}}}