{"data":{"site":{"siteMetadata":{"title":"Alex Love's Personal Website","author":"Alex Love"}},"markdownRemark":{"id":"1afaf040-c9d6-5468-b6e3-160426327fde","excerpt":"First Some Context For My Rant I’ve been seeing a lot of news lately about politicians talking about free college. While I think this is a wonderful idea that…","html":"<h3>First Some Context For My Rant</h3>\n<p>I’ve been seeing a lot of news lately about politicians talking about free college. While I think this is a wonderful idea that at least deserves considering, I think we are forgetting something.</p>\n<h4>Before Free College, We Need To Help Those With Student Loans</h4>\n<p><a href=\"https://nces.ed.gov/fastfacts/display.asp?id=900\">First a statistic from a .gov address, which means it’s legit, definitely no need to fact-check whatsoever</a></p>\n<blockquote>\n<p>Twelve years after beginning postsecondary education in 2003–04, some 20 percent of borrowers had fully paid off their loans without defaulting and 27 percent had defaulted on at least one loan.</p>\n</blockquote>\n<p>So here we have some information about students students from 2003-04, these peope went to college over 15 years ago, so we’ve had some time to see the effect of these student loans. For now I’ll ignore that the cost of tuition has continued to outpace inflation and other metrics, <a href=\"https://nces.ed.gov/programs/coe/indicator_cub.asp\">especially at non-profit private schools.</a> Also ignoring the general perception that a college degree is worth less and costs more money.</p>\n<p>In 12 years, close to a third of students has defaulted on a loan and only 20 percent have paid off their loans in full. When you default on a student loan, you can’t declare bankruptcy\nand restructure the your debt burdens. You are stuck. Sure, students are responsible for the debt they take on, but society also encourages students to take on high amounts of debt and schoool often does not teach you the long-term cost of student loans. </p>\n<p>These loans are a burden to society, they are a burden to our consumer base, a huge business and economic driver. People are stuck paying hundreds to thousands a month, when they would otherwise be saving or spending that money. This is especially true when it comes to homeownership. As seen <a href=\"https://www.census.gov/library/stories/2018/08/homeownership-by-age.html\">in this graph</a>, we can see that young Americans, as well as all Americans, continue to trend down in terms of homeownsership, especially those under 35. </p>\n<h4>After College</h4>\n<p>So now we have college graduates leaving college with a bunch of debt to pay off. For most, a mortgage will be out of question for a while. Assuming the average $30,000 in debt <a href=\"https://www.forbes.com/sites/zackfriedman/2018/06/13/student-loan-debt-statistics-2018/#234d052c7310\">(as cited in this forbes article that probably could use more fact-checking)</a>, to obtain a debt-to-income ration of around 43%, the individual would need to be making at least $70,000 a year. Obviously this is just napkin math and most college graduates aren’t looking to buy a house immediately after college and also have other sources of debt, such as car loans and cc debt.</p>\n<h4>Consumption in America</h4>\n<p>Not looking at any research, I would assume that most money saved off of student loans would either be spent or saved. There really aren’t many other options. The money would immediately be pumped back into the economy, assuming people were confident enough to spend money. </p>\n<h4>Free College</h4>\n<p>So now we have this proposal of free college. Want to build resent among millions of voters in America? Suggest that their tax money go towards those likely younger than them so that they can avoid a situation that millions are still in. If we follow my principle that most voters are selfish and will support policy that they think will serve them best, free college will not do well at the polls.</p>\n<h4>A Proposal</h4>\n<p>So instead of free college, why don’t we first deal with the heavy weight that is student loan debt. Let’s stop the problem from the source and phase out the predatory student loans that are presented to young students with little knowledge of how they work. </p>\n<p>Let’s find a different way to help pay for school that doesn’t involve indebting individuals for a non-tagible asset for the greater majority of their young-adulthood, if not longer. Perhaps <a href=\"https://www.latimes.com/business/la-fi-college-income-share-20180720-story.html\">income share agreements, </a> an agreement where a student pays a percent of their future salary could work? </p>","frontmatter":{"title":"What's the deal with Free College","date":"February 10, 2019","description":null}}},"pageContext":{"slug":"/free-college-a-rant/","previous":{"fields":{"slug":"/safeway-bagels/"},"frontmatter":{"title":"The Safeway Bagels in My Town are not Bagels"}},"next":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}}}}